#Створити файл із розкладом руху приміських поїздів 
#декількома напрямками (по кожному напрямку по 
#3-5 рейсів протягом дня): номер рейсу, напрямок 
#руху, час відправлення, час прибуття в кінцевий 
#пункт. Зі складеного розкладу сформувати зимовий 
#розклад (новий файл), в якому мають бути лише 
#ранкові (до 10:00) та вечірні (після 18:00) рейси.
#Відповідність модульному підходу
#Виведення вхідних, проміжкових та вихідних даних.
#Створення файла програмним шляхом.
#Можливість доповнення файла.

import module
from class1 import TTimeTable

fileInName = "input.txt"    #назва файлу введених даних (№1)
fileOutName = "output.txt"  #назва кінцевого файлу (№2)
module.fileInput(fileInName, module.choice(fileInName)) #введення даних у файл
module.fileOutput(fileInName)                           #виведення файлу №1
module.fileCreate(fileInName, fileOutName)              #створення файлу №2 відповідно до завдання
module.fileOutput(fileOutName)                          #виведення файлу №2