/*
Створити файл із розкладом руху приміських поїздів 
декількома напрямками (по кожному напрямку по 
3-5 рейсів протягом дня): номер рейсу, напрямок 
руху, час відправлення, час прибуття в кінцевий 
пункт. Зі складеного розкладу сформувати зимовий 
розклад (новий файл), в якому мають бути лише 
ранкові (до 10:00) та вечірні (після 18:00) рейси.
Відповідність модульному підходу
Виведення вхідних, проміжкових та вихідних даних.
Створення файла програмним шляхом.
Можливість доповнення файла.
*/

#include "lib.h"

int main()
{
	string fileIn = "input.txt";	//назва файлу введених даних (№1)
	string fileOut = "output.txt";	//назва кінцевого файлу (№2)
	choice(fileIn);					//введення даних у файл
	fileOutput(fileIn);				//виведення файлу №1
	fileCreate(fileIn, fileOut);	//створення файлу №2 відповідно до завдання
	fileOutput(fileOut);			//виведення файлу №2
	system("pause");
}