/*
Розробити клас, який є абстракцією тексту та 
підтримує операції додавання рядка до тексту 
і визначення відсотка символів-цифр у тексті. 
Створити масив об'єктів даного класу. Доповнити 
декілька текстів новими рядками. Визначити текст 
з найменшим відсотком символів-цифр.
*/
#include "module.h"

int main()
{
	TTextArr textArr = textArrGen();	//створення масиву об'єктів класу
	textArrInput(textArr);				//введення текстів масиву
	textArrOutput(textArr);				//виведення масиву текстів
	symbolPercComp(textArr);			//визначення тексту з найменшим відсотком символів-цифр
	system("pause");
}