/*
Розробити клас, який є абстракцією тексту та 
підтримує операції додавання рядка до тексту 
і визначення відсотка символів-цифр у тексті. 
Створити масив об'єктів даного класу. Доповнити 
декілька текстів новими рядками. Визначити текст 
з найменшим відсотком символів-цифр.
*/
#include "TTextArr.h"

int main()
{
	TTextArr textArr;			//об'єкт класу масиву об'єктів класу абстракції тексту
	textArr.textArrGen();		//створення масиву об'єктів класу
	textArr.textArrInput();		//введення текстів масиву
	textArr.textArrOutput();	//виведення масиву текстів
	textArr.symbolPercComp();	//визначення тексту з найменшим відсотком символів-цифр
	textArr.textArrDel();		//видалення масиву з пам'яті
	system("pause");
}