/*
клас "Трикутник" 
 * атрибути координат вершин у просторі
 * декілька конструкторів
 * геттери
 * метод обчислення периметра
 * префіксний "++" - для х-координат
 * постфіксний "++" - для у-координат
 * "+=" - збільшення всіх координат на задану величину
Т1, Т2, Т3 - 3 трикутники, створені різними конструкорами
Т1 - інкрементувати х-координати
Т2 - інкрементувати у-координати
Т3 - збільшити координати вершин на вказану величину
серед Т1-3 визначити з найбільшим периметром
*/

#include "module.h"
using namespace std;

int main()
{
	//створення першого трикутника
	cout << "The first triangle: ";
	TPoint p[3];
	pointArrInput(p, 3);
	TTriangle T1(p[0], p[1], p[2]);
	T1.output();
	
	//створення другого трикутника
	cout << "\nThe second triangle: ";
	int len[3];
	lenArrInput(len, 3);
	TTriangle T2(len[0], len[1], len[2]);
	T2.output();
	
	//створення третього трикутника
	cout << "\nThe third triangle: ";
	TTriangle T3(T2);
	T3.output();
	
	//інкрементування х-координат
	++T1;	T1.output();

	//інкрементування у-координат
	T2++;	T2.output();

	//збільшення координат на задану величину
	T3 += addInput();	T3.output();

	//визначення максимального периметру
	maxPerimeter(T1, T2, T3);

	system("pause");
}